PRAGMA foreign_keys=OFF;
BEGIN TRANSACTION;
CREATE TABLE "clients" (
	`id`	INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
	`NAME`	VARCHAR (55) NOT NULL,
	`TELEPHON`	VARCHAR (25) NOT NULL,
	`MAIL`	VARCHAR (55),
	`address`	VARCHAR (55),
	`inform`	VARCHAR (55),
	`url_address`	VARCHAR (55)
);
INSERT INTO "clients" VALUES(1,'Чернов Дмитрий','+7-918-777-40-40',NULL,NULL,NULL,NULL);
INSERT INTO "clients" VALUES(4,'Ольга Григорьевна','+79288237789,+79188790712',NULL,'Лесовод дача','',NULL);
INSERT INTO "clients" VALUES(5,'Света Труфанова','89187838365',NULL,NULL,NULL,NULL);
INSERT INTO "clients" VALUES(6,'Переверзев Евг.','+79887018908',NULL,'МИХАЙЛОВСК Ленина 167/2 кв. 282 9эт.',NULL,NULL);
INSERT INTO "clients" VALUES(7,'Валентина Васильевна','89624501415',NULL,'Лесовод дача',NULL,NULL);
CREATE TABLE "friends" (
    "name" TEXT NOT NULL,
    "tel" TEXT,
    "address" TEXT NOT NULL,
    "info" TEXT,
    "mail" TEXT,
    "url" TEXT
);
INSERT INTO "friends" VALUES('Виктор','89624010146','с.Татарка','продажа, маток, пчелопакетов',NULL,NULL);
INSERT INTO "friends" VALUES('Пчеловод_союз','88652270717','Комсомольская 8а','ПЧЕЛОВОД, СТАВРОПОЛЬСКОЕ ГОРОДСКОЕ ОБЩЕСТВЕННОЕ ОБЪЕДИНЕНИЕ

Пчеловодство - оборудование, инвентарь, продукция ',NULL,NULL);
INSERT INTO "friends" VALUES('Валерий Константинович',' т. 8-988-701-40-60','Ставрополь ул. Васякина 140-2',NULL,NULL,NULL);
INSERT INTO "friends" VALUES('Интернет магазин http://www.pchelovodu.com',NULL,'г.кропоткин',NULL,NULL,'http://www.pchelovodu.com');
INSERT INTO "friends" VALUES('Интернет Магазин',NULL,'Карелия',NULL,NULL,'http://www.pchelovod.com');
INSERT INTO "friends" VALUES('Алексей Николаевич','+79383115017','Георгиевск','изготовление и доставка ульев',NULL,'на avito.ru');
CREATE TABLE "расход" (
    "id" INTEGER NOT NULL,
    "Дата_закупки" TEXT NOT NULL,
    "наименование" TEXT NOT NULL,
    "количество" INTEGER NOT NULL,
    "цена" REAL NOT NULL,
    "примечание" TEXT
);
INSERT INTO "расход" VALUES(1,'15/05/2015','вощина рут',11,23.0,NULL);
INSERT INTO "расход" VALUES(2,'25/06/2015','вощина рут',22,23.0,NULL);
INSERT INTO "расход" VALUES(3,'20/07/2015','интернет заказ на pchelovod.com',1,2200.0,NULL);
INSERT INTO "расход" VALUES(4,'07/08/2015','закупка в пчел. союзе',1,1050.0,NULL);
INSERT INTO "расход" VALUES(5,'13/08/2016','цеплята уток "Башкирской породы" *доп. ферма',10,50.0,NULL);
INSERT INTO "расход" VALUES(6,'13/08/2016','отруби пшеничные  *доп. ферма',2,200.0,'в мешках');
INSERT INTO "расход" VALUES(7,'13/08/2016','корм "старт"  *доп. ферма',5,35.0,'ведро');
INSERT INTO "расход" VALUES(8,'15/08/2016','фанера 12 мм',1,800.0,NULL);
INSERT INTO "расход" VALUES(9,'16/08/2016','фанера 6 мм',1,600.0,NULL);
INSERT INTO "расход" VALUES(10,'02/09/2016','холстики',2,60.0,NULL);
INSERT INTO "расход" VALUES(11,'02/09/2016','подушка дадан',1,110.0,NULL);
INSERT INTO "расход" VALUES(12,'02/09/2016','полоски "вароадез"',3,140.0,NULL);
INSERT INTO "расход" VALUES(13,'02/09/2016','препарат "бипин"',1,25.0,NULL);
INSERT INTO "расход" VALUES(14,'11/09/2016','корм "кукуруза сечка" *доп. ферма',1,650.0,'в мешках');
INSERT INTO "расход" VALUES(15,'03/10/2016','корм "комбинир." *доп. ферма',1,450.0,'мешок');
INSERT INTO "расход" VALUES(16,'26/10/2016','корм "пшеница" *доп. ферма',1,500.0,'мешок');
INSERT INTO "расход" VALUES(17,'04/10/2017','Полоски варроадез 10 пластин',2,150.0,'для лечения и проф. варроатоза и акарапидоза');
INSERT INTO "расход" VALUES(18,'04/10/2017','Бивараоол',1,40.0,'для лечения и проф. варроатоза');
INSERT INTO "расход" VALUES(19,'16/06/2017','Полоски варроадез 10 пластин',2,150.0,'для лечения и проф. варроатоза');
INSERT INTO "расход" VALUES(20,'16/06/2017','проволока пчеловод. нерж',1,50.0,'х18н10т диам.0.4');
INSERT INTO "расход" VALUES(21,'16/06/2017','вощина дадан лист.',10,65.0,NULL);
INSERT INTO "расход" VALUES(22,'08/06/2017','вощина дадан лист.',10,65.0,NULL);
INSERT INTO "расход" VALUES(23,'08/06/2017','фильтр',1,500.0,NULL);
CREATE TABLE "медосбор" (
    "наименование_продукта" TEXT NOT NULL,
    "дата" TEXT,
    "№_улья" TEXT,
    "количество_объем" TEXT,
    "кол-во_кг" TEXT,
    "примечание" TEXT
);
INSERT INTO "медосбор" VALUES('мед разнотравье','04/07/2015','6','12','18',NULL);
INSERT INTO "медосбор" VALUES('мед разнотравье','30/07/2015','3','6','10','из магазиных рамок');
INSERT INTO "медосбор" VALUES('мед разнотравье','03/08/2015','6','','18',NULL);
INSERT INTO "медосбор" VALUES('мед разнотравье','18/08/2015','6','5',NULL,NULL);
INSERT INTO "медосбор" VALUES('мед весенний','13/05/2016','6','','3',NULL);
INSERT INTO "медосбор" VALUES('Мед майский','14/06/2016','6','3.5','5',NULL);
INSERT INTO "медосбор" VALUES('мед майский','20/06/2016','6','','4',NULL);
INSERT INTO "медосбор" VALUES('мед разнотравье','04/07/2016','6',NULL,'8',NULL);
INSERT INTO "медосбор" VALUES('мед разнотравье','04/07/2016','5',NULL,'1',NULL);
INSERT INTO "медосбор" VALUES('мед липовый','06/07/2016','7',NULL,'5',NULL);
INSERT INTO "медосбор" VALUES('мед липовый','26/07/2016','7',NULL,'2',NULL);
INSERT INTO "медосбор" VALUES('мед разнотравье','29/07/2016','6',NULL,'14',NULL);
INSERT INTO "медосбор" VALUES('мед разнотравье','01/08/2016','6',NULL,'14',NULL);
INSERT INTO "медосбор" VALUES('мед разнотравье','01/08/2016','5',NULL,'10',NULL);
INSERT INTO "медосбор" VALUES('мед разнотравье','23/08/2016','6','','6',NULL);
INSERT INTO "медосбор" VALUES('мед разнотравье','23/08/2016','9','','4',NULL);
INSERT INTO "медосбор" VALUES('мед разнотравье','23/08/2016','5','','6',NULL);
INSERT INTO "медосбор" VALUES('мед липовый','24/08/2016','1',NULL,'6',NULL);
INSERT INTO "медосбор" VALUES('Мед майский','22/05/2017','6','','6',NULL);
INSERT INTO "медосбор" VALUES('Мед майский','09/06/2017','6','','9',NULL);
INSERT INTO "медосбор" VALUES('Мед майский','10/06/2017','1',NULL,'2',NULL);
INSERT INTO "медосбор" VALUES('мед  акация','12/06/2017','1',NULL,'7',NULL);
INSERT INTO "медосбор" VALUES('мед  акация','14/06/2017','1',NULL,'7',NULL);
INSERT INTO "медосбор" VALUES('мед  акация','16/06/2017','1',NULL,'2',NULL);
INSERT INTO "медосбор" VALUES('мед  акация','16/06/2017','7',NULL,'3',NULL);
INSERT INTO "медосбор" VALUES('мед акация','06/29/2017','6',NULL,'5',NULL);
INSERT INTO "медосбор" VALUES('мед липовый','07/02/2017','7',NULL,'7.5',NULL);
INSERT INTO "медосбор" VALUES('мед с московского','07/11/2017',NULL,NULL,'6.5','');
INSERT INTO "медосбор" VALUES('мед липовый','08/03/2017','1',NULL,'8.5',NULL);
INSERT INTO "медосбор" VALUES('мед липовый','08/05/2017','4',NULL,'15',NULL);
INSERT INTO "медосбор" VALUES('мед липовый','08/07/2017','4',NULL,'10',NULL);
INSERT INTO "медосбор" VALUES('мед липовый','08/09/2017','3',NULL,'12',NULL);
INSERT INTO "медосбор" VALUES('мед липовый','08/14/2017','3',NULL,'6',NULL);
INSERT INTO "медосбор" VALUES('мед липовый','08/14/2017','2',NULL,'7',NULL);
INSERT INTO "медосбор" VALUES('мед липовый','08/15/2017','7',NULL,'13',NULL);
INSERT INTO "медосбор" VALUES('мед разнотравье ','08/16/2017','10',NULL,'14','с. Московкого');
CREATE TABLE sales (
    "дата" VARCHAR (15),
    "продукт" VARCHAR (55) NOT NULL,
    "примечание" VARCHAR (55),
    "количество_kg" INTEGER,
    "цена_кг" REAL  NOT NULL,
    "сумма" REAL
);
INSERT INTO "sales" VALUES('20.05.2015','Майский мед','урожай 2015',5,280.0,1400.0);
INSERT INTO "sales" VALUES('17/06/2015','Мед Акация',NULL,6,280.0,1680.0);
INSERT INTO "sales" VALUES('18/06/2015','Майский мед, Мед Акация',NULL,3,300.0,900.0);
INSERT INTO "sales" VALUES('19/06/2015','Мед Акация',NULL,5,280.0,1400.0);
INSERT INTO "sales" VALUES('28/06/2015','мед акация','урожай 2015',1,350.0,350.0);
INSERT INTO "sales" VALUES('30/06/2015','мед майский',NULL,2,300.0,600.0);
INSERT INTO "sales" VALUES('01/07/2015','мед майский,акация',NULL,10,305.0,3050.0);
INSERT INTO "sales" VALUES('02/07/2015','мед акация',NULL,1,350.0,350.0);
INSERT INTO "sales" VALUES('09/07/2015','мед акация',NULL,5,300.0,1500.0);
INSERT INTO "sales" VALUES('19/07/2015','мед "Разнотравье с акацией"','цена со скидкой',5,260.0,1300.0);
INSERT INTO "sales" VALUES('02/08/2015','мед "Разнотравье с акацией"','цена со скидкой',8,340.0,2700.0);
INSERT INTO "sales" VALUES('04/08/2015','мед "ЛИПА"','цена со скидкой',5,260.0,1300.0);
INSERT INTO "sales" VALUES('18/08/2015','Мед "Разнотравье"',NULL,5,260.0,1300.0);
INSERT INTO "sales" VALUES('24/08/2015','Мед "Акация"',NULL,0.85,470.0,400.0);
INSERT INTO "sales" VALUES('28/09/2015','Мед "Акация"','цена со скидкой',0.5,352.0,300.0);
INSERT INTO "sales" VALUES('28/09/2015','Мед "Сотовый"',NULL,'0,2',600.0,120.0);
INSERT INTO "sales" VALUES('11/16/2015','Мед"Акация"',NULL,1,400.0,400.0);
INSERT INTO "sales" VALUES('11/16/2015','Мед "Разнотравье"',NULL,1,300.0,300.0);
INSERT INTO "sales" VALUES('11/17/2015','мед "ЛИПА"',NULL,1,350.0,350.0);
INSERT INTO "sales" VALUES('11/02/2016','Мед "Разнотравъе"','со скидкой',5,180.0,900.0);
INSERT INTO "sales" VALUES('26/02/2016','Мед"Акация"',NULL,1.25,360.0,450.0);
INSERT INTO "sales" VALUES('26/03/2016','Мед"Акация"',NULL,0.85,470.0,400.0);
INSERT INTO "sales" VALUES('26/03/2016','Мед "Разнотравъе"','бартер',1,300.0,300.0);
INSERT INTO "sales" VALUES('02/08/2016','Мед "Разнотравъе"',NULL,9.6,250.0,2400.0);
INSERT INTO "sales" VALUES('02/08/2016','мед "сотовый"',NULL,1,300.0,300.0);
INSERT INTO "sales" VALUES('02/08/2016','мед "Липовый"',NULL,2,300.0,600.0);
INSERT INTO "sales" VALUES('03/08/2016','мед "сотовый"',NULL,1,150.0,350.0);
INSERT INTO "sales" VALUES('04/08/2016','мед "сотовый"',NULL,0.25,400.0,100.0);
INSERT INTO "sales" VALUES('04/08/2016','Мед "Разнотравъе"',NULL,2,350.0,700.0);
INSERT INTO "sales" VALUES('04/08/2016',' мед "Майский"',NULL,1,450.0,450.0);
INSERT INTO "sales" VALUES('17/08/2016','Мед "Разнотравъе"',NULL,4.9,265.0,1300.0);
INSERT INTO "sales" VALUES('29/08/2016','Мед "Разнотравъе"',NULL,4.9,265.0,1300.0);
INSERT INTO "sales" VALUES('21/09/2016',' мед "Майский"',NULL,2,450.0,900.0);
INSERT INTO "sales" VALUES('10/06/2017',' мед "Майский"',NULL,9,339.0,3050.0);
INSERT INTO "sales" VALUES('10/06/2017','обножка весенняя',NULL,0.2,2000.0,400.0);
INSERT INTO "sales" VALUES('08/03/2017',' мед акация',NULL,1.5,462.0,NULL);
INSERT INTO "sales" VALUES('08/03/2017',' мед акация',NULL,'1,5',462.0,NULL);
INSERT INTO "sales" VALUES('08/03/2017',' мед акация',NULL,'1,5',462.0,NULL);
INSERT INTO "sales" VALUES('08/04/2017',' мед акация',NULL,2.2,500.0,1100.0);
INSERT INTO "sales" VALUES('08/04/2017','мед липовый',NULL,'8,5',400.0,3400.0);
INSERT INTO "sales" VALUES('08/04/2017','сотовый мед',NULL,'2,0',600.0,1200.0);
INSERT INTO "sales" VALUES('08/17/2017','сотовый мед',NULL,'3,1',484.0,1500.0);
CREATE TABLE `apis_inventory` (
    `id` INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
    `наименование` TEXT NOT NULL,
    `количество` INTEGER,
    `цена` TEXT,
    `примечание` TEXT
);
INSERT INTO "apis_inventory" VALUES(1,'медогонка на 2 рамки',1,'8000','Дата покупки 2013');
INSERT INTO "apis_inventory" VALUES(2,'улей дадан с магазинами',3,'3400','12 рамок + 2 магазина Дата покупки 2013');
INSERT INTO "apis_inventory" VALUES(3,'улей полулежак рут',1,'3200','16 рамок + магазин Дата покупки 2013');
INSERT INTO "apis_inventory" VALUES(4,'дырокол',1,'800','дырокол для рамок');
INSERT INTO "apis_inventory" VALUES(5,'дымарь чёрный',1,'300',NULL);
INSERT INTO "apis_inventory" VALUES(6,'дымарь нерж.',2,'700',NULL);
INSERT INTO "apis_inventory" VALUES(7,'улей рут  3 корпусн.',4,'2500',NULL);
INSERT INTO "apis_inventory" VALUES(8,'диафрагма дадан',6,'150',NULL);
INSERT INTO "apis_inventory" VALUES(9,'диафрагма рут',6,'150',NULL);
INSERT INTO "apis_inventory" VALUES(10,'воскотопка с арматурой',1,'3500',NULL);
INSERT INTO "apis_inventory" VALUES(11,'сетка лицевая',3,'300',NULL);
INSERT INTO "apis_inventory" VALUES(12,'комбинезон "Пчеландия"',1,'110',NULL);
INSERT INTO "apis_inventory" VALUES(13,'рамка рутовская',52,'100',NULL);
INSERT INTO "apis_inventory" VALUES(14,'рамка дадановская',30,'100',NULL);
INSERT INTO "apis_inventory" VALUES(15,'Ящик для отводков на 5 рамок(рут)',4,'500',NULL);
INSERT INTO "apis_inventory" VALUES(16,'Клеточка маточная "Титова"',8,'75','металлическая');
INSERT INTO "apis_inventory" VALUES(17,'Колпачок для матки',1,'100',NULL);
INSERT INTO "apis_inventory" VALUES(18,'Стамеска пчеловодческая нерж.',1,'150',NULL);
INSERT INTO "apis_inventory" VALUES(19,'нож пасечный',2,'75',NULL);
INSERT INTO "apis_inventory" VALUES(20,'лекало для рамки дадан',1,'100',NULL);
INSERT INTO "apis_inventory" VALUES(21,'лекало для рамки рут',1,'100',NULL);
INSERT INTO "apis_inventory" VALUES(22,'лекало для рамки магазин',1,'100',NULL);
INSERT INTO "apis_inventory" VALUES(23,'Совочек для улья',1,'150',NULL);
INSERT INTO "apis_inventory" VALUES(24,'Вилка Металлическая для сот',1,'100',NULL);
INSERT INTO "apis_inventory" VALUES(25,'Холстик рут',5,'50',NULL);
INSERT INTO "apis_inventory" VALUES(26,'Холстик дадан',4,'50',NULL);
INSERT INTO "apis_inventory" VALUES(27,'Подушка дадан',4,'55',NULL);
INSERT INTO "apis_inventory" VALUES(28,'ремень стяжка улья',4,'55',NULL);
INSERT INTO "apis_inventory" VALUES(29,'Кормушка потолочная 2л',4,'75',NULL);
INSERT INTO "apis_inventory" VALUES(30,'кормушка рамочная',1,'150',NULL);
INSERT INTO "apis_inventory" VALUES(31,'Электронаващиватель',1,'750','Дата покупки 2013');
INSERT INTO "apis_inventory" VALUES(32,'Ус-во для сбора перги',1,'550','металлическое устройство в виде шприца');
INSERT INTO "apis_inventory" VALUES(33,'пыльцесборники ',4,'50','');
INSERT INTO "apis_inventory" VALUES(34,'перчатки пчеловода',1,'450',NULL);
INSERT INTO "apis_inventory" VALUES(35,'Фильтр на бидон',2,'500',NULL);
INSERT INTO "apis_inventory" VALUES(36,'Бидон 40л',1,'1000',NULL);
INSERT INTO "apis_inventory" VALUES(37,'поилки пластиковые ',3,'25','под банку');
INSERT INTO "apis_inventory" VALUES(38,'комбинизон льняной',1,'500',NULL);
INSERT INTO "apis_inventory" VALUES(39,'Горелка газовая',1,'250','под балончик');
INSERT INTO "apis_inventory" VALUES(40,'нож пасечный',1,'200','дата закупки 03/07/2015');
INSERT INTO "apis_inventory" VALUES(41,'холстик с пропиткой рут',4,'60','дата закупки 03/07/2015');
INSERT INTO "apis_inventory" VALUES(42,'холстик с пропиткой дадан',2,'60','дата закупки 03/07/2015');
INSERT INTO "apis_inventory" VALUES(43,'Шпатель-захват нажимной "китайский шпатель"',1,'79','04/08/2015 на пчеловод.ком ');
INSERT INTO "apis_inventory" VALUES(44,'Шпатель металлический для переноса личинок "AustriaBee"',1,'389',NULL);
INSERT INTO "apis_inventory" VALUES(45,'Кормушка-рамка внутриульевая ',2,'149',NULL);
INSERT INTO "apis_inventory" VALUES(46,'подушка дадан "серого цвета"',2,'110','дата покупки 07/08/2015 (пчел. союз)');
INSERT INTO "apis_inventory" VALUES(47,'колпачек для матки "пластиковый синий"',1,'50','дата покупки 07/08/2015 (пчел. союз)');
INSERT INTO "apis_inventory" VALUES(48,'Улей "дадан" 3 корпуса',1,'2000','28/09/2015 дата изготовления');
INSERT INTO "apis_inventory" VALUES(49,'пыльцесборник "курск"',1,'160','07/04/2016 дата закупки для пробы');
INSERT INTO "apis_inventory" VALUES(50,'подушка рут',1,'100','07/04/2016');
INSERT INTO "apis_inventory" VALUES(51,'задвижка летка',4,'35','07/04/2016');
INSERT INTO "apis_inventory" VALUES(52,'комплект рамок "хвойные"',1,'500','07/04/2016');
INSERT INTO "apis_inventory" VALUES(54,'подушка "дадан"',1,'110','02/09/2016 дата закупки');
INSERT INTO "apis_inventory" VALUES(57,'Улей "универсальный лежак" (рут-2/3)',1,'1500','(изготовлен из сосны 35 мм.)');
CREATE TABLE books_apis (
    `id`	INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
    "NAME" TEXT NOT NULL,
    "autor" TEXT,
    "количество" INTEGER NOT NULL,
    "ЦЕНА" REAL,
    "ПРИМЕЧАНИЕ" TEXT
, "ISBN" TEXT);
INSERT INTO "books_apis" VALUES(1,'Энциклопедия пчеловода','А.Н. Бурмистров кандидат сельскохозяйственных наук,
Н.И. Кривцов Профессор сельскохозяйственных наук,
В.И. Лебедев Профессор сельскохозяйственных наук,
О.К Чупахина Кандидат ветеренарных наук.
',1,250.0,'ООО "НПФ Вереск" 2012
Рассчитана на специалистов, фермеров и пчеловодов любителей

','978-5-9042-5401-8');
INSERT INTO "books_apis" VALUES(2,'Современная энциклопедия пчеловода','С.А. Бондарев, Ромашкин П.С.',1,200.0,'Издательский дом "Владис" Ростов-на-дону 2010','978-5-9567-1142-2');
INSERT INTO "books_apis" VALUES(3,'Пчеловодство','Климентов А.А.',1,150.0,'Сельхозгис, Москва 1954г.',NULL);
INSERT INTO "books_apis" VALUES(4,'Пчеловодство','В.И Колмацкий, С.В.Логинов,Г.В.Колмацкий',1,413.0,'ООО "Феникс" Ростов н/Д 2013 412 с.','978-5-222-20428-3');
INSERT INTO "books_apis" VALUES(5,'Селекционная работа на пасеке','Н.М.Кокорев Б.Я. Чернов',1,150.0,'ТИД Континент-Пресс Москва 2011 ','978-5-9206-0227-9');
INSERT INTO "books_apis" VALUES(6,'Пчелы разведение и содержание','Т.В.Руцкая',1,85.0,'ООО "Издательство Агата"  2012 - 192 с. серия подворъе','978-5-9206-0227-9');
INSERT INTO "books_apis" VALUES(7,'Медоносная база','Н.М.Кокорев Б.Я. Чернов',2,50.0,'ТИД Континент-Пресс Москва 2010','978-5-9206-0228-7');
INSERT INTO "books_apis" VALUES(8,'Медоносные деревья и кустарники','А.П.Савин, К.В. Богомолов',1,149.0,'Рязань 2013','978-5-91255-122-2');
INSERT INTO "books_apis" VALUES(9,'Основные болезни пчел профилактика и личение','Н.И.Кривцов - профессор,академик РАСХН,
В.И. Лебедеа Доктор С.Х.Н.
О.К. Чупахина  кандидат ветеринарных наук
В.И. Чупахин  кандидат ветеринарных наук',1,200.0,'Москва 2011 серия "Пчелодар" - 208 с. ','978-5-904254-08-7');
INSERT INTO "books_apis" VALUES(10,'Вывод пчелиных маток практическое руководство','В.В. Малков, А.Г. Мартынов, С.Н. Назин',1,300.0,'Рязань "Русское слово" 1994 г. - 103 с. ','5-900312-16-Х');
CREATE TABLE jornal (
    "дата осмотра" TEXT NOT NULL,
    "сила семьи(улочек)" TINYINT,
    "всего рамок" TINYINT,
    "порода матки" TEXT,
    "возраст матки" TINYINT,
    "продуктивность" TEXT,
    "дано вощины листов" TINYINT,
    "другие сведения" TEXT NOT NULL,
    "номер_улья" TEXT NOT NULL
);
INSERT INTO "jornal" VALUES('04/03/2015',NULL,NULL,'карпатка ',1,NULL,NULL,'Быстрый Осмотр (БО). Плесень в улье, поноса нет,облёт дружный. Почистил подмор.','№1 дадан');
INSERT INTO "jornal" VALUES('10/03/2015',6,9,'карпатка',1,NULL,NULL,'Быстрый Осмотр (БО). Плесень в улье, поноса нет,облёт дружный. Почистил подмор. Проф. Бипином.Подкормка.
','№3 дадан');
INSERT INTO "jornal" VALUES('10/03/2015',6,9,'капатка',1,NULL,NULL,'Быстрый Осмотр (БО).  поноса нет,облёт дружный. Почистил подмор. Проф. Бипином.Подкормка.','№2 дадан');
INSERT INTO "jornal" VALUES('10/03/2015',5,8,'карпатка',1,NULL,NULL,'Быстрый Осмотр (БО).  облёт дружный. Почистил подмор. Проф. Бипином.Подкормка.','№1 дадан');
INSERT INTO "jornal" VALUES('10/03/2015',9,18,'карпатка',1,NULL,NULL,'Быстрый Осмотр (БО). Плесень в улье,поноса нет, облёт дружный. Проф. Бипином. Подкормка.','№5 рут 2х корпусный');
INSERT INTO "jornal" VALUES('26/03/2015',NULL,NULL,'карпатка с.нижняя татарка',2,NULL,NULL,'БО. Почистил подмор. поноса нет, облёт дружный. Проф. Бипином. Зимовка отлично.','№6 рут 4х корпусный');
INSERT INTO "jornal" VALUES('18/04/2015',10,11,'карпатка',1,NULL,1,'БО. Расплод есть, открытый и закрытый на выходе.','№2 дадан');
INSERT INTO "jornal" VALUES('18/04/2015',9,10,'карпатка',1,NULL,1,'БО. Расплод есть.','№3 Дадан');
INSERT INTO "jornal" VALUES('18/04/2015',8,9,'карпатка',1,NULL,1,'БО. Расплод есть.','№1 Дадан');
INSERT INTO "jornal" VALUES('18/04/2015',14,15,'карпатка',3,NULL,1,'БО. Расплод есть, мало в расброс.','№4 Рут 16 рамок');
INSERT INTO "jornal" VALUES('03/05/2015',19,27,'карпатка',1,NULL,'дано светлая сушь 9 рамок','Переселено с №5 18 рамок. 3 рамки расплода.','№7 Рут 3-х корпусный');
INSERT INTO "jornal" VALUES('12/05/2015',12,15,'карпатка',3,NULL,2,'Расплода мало, есть трутневый. Обнаружил закрытый маточник, видимо готовят тихую смену (ТС)','№4 рут 16 рамок');
INSERT INTO "jornal" VALUES('15/05/2015',16,18,'карпатка',2,'отличная',10,'Расплод открытый и закрытый. При осмотре обнаружил и удалил открытые маточники.','№6 рут(с. Московское )');
INSERT INTO "jornal" VALUES('19/05/2015',10,11,'карпатка',1,NULL,1,'Расплод открытый и закрытый. При осмотре обнаружил и удалил открытые маточники. Установил магазин с 10 рамками.','№3 Дадан 12');
INSERT INTO "jornal" VALUES('19/05/2015',11,12,'карпатка',1,NULL,NULL,'Расплод открытый и закрытый. При осмотре обнаружил и удалил открытые маточники. Установил магазин с 10 рамками.','№2 Дадан 12');
INSERT INTO "jornal" VALUES('24/05/2015',9,9,NULL,NULL,NULL,NULL,'Матка вышла, расплода открытого  нет. Подставил расплод закрытый и открытый с №7 рут. ','№4 рут 16 рамочный');
INSERT INTO "jornal" VALUES('10/06/2015',10,15,'карпатка',0,'хорошая',NULL,'Появился расплод открытый и закрытый, обнаружен маточник, поместил в клетку титова.','№4 рут 16 рамочный');
INSERT INTO "jornal" VALUES('26/06/2015',30,36,'карпатка',1,'отличная',6,'Расплод открытый и закрытый.','№7 рут');
INSERT INTO "jornal" VALUES('28/06/2015',12,12,'карпатка',1,NULL,1,'Расплод открытый и закрытый, нужна замена сот.','№3 дадан');
INSERT INTO "jornal" VALUES('14/07/2015',11,16,'карпатка',0,NULL,NULL,'Расплод открытый и закрытый.','№4 рут 16 рамочный');
INSERT INTO "jornal" VALUES('19/07/2015',11,11,'карпатка',1,'хорошая',1,'Расплод открытый и закрытый.','№1 дадан');
INSERT INTO "jornal" VALUES('19/07/2015',12,12,'карпатка',1,NULL,2,'Расплод открытый и закрытый.','№3 дадан');
INSERT INTO "jornal" VALUES('19/07/2015',9,11,'карпатка',1,NULL,NULL,'Нет расплода! Подставил 2 рамки с открытым и закрытым расплодом. Семью под усиленое наблюдение.','№2 дадан');
INSERT INTO "jornal" VALUES('30/07/2015',9,11,'карпатка',1,NULL,NULL,'Расплод открытый и закрытый.','№2 дадан');
INSERT INTO "jornal" VALUES('03/08/2015',27,27,'карпатка',2,'отличная',2,'Расплод открытый и закрытый.','№6 рут 3х корпусный');
INSERT INTO "jornal" VALUES('15/08/2015',11,12,'карпатка',1,'удовлетворительная',NULL,'расплод закрытый, нет открытого, матка не обнаружена, поставил антиварроатозные и антиакарапидозные полоски.','№1 дадан');
INSERT INTO "jornal" VALUES('18/08/2015',25,27,'карпатка',2,'отличная',NULL,'расплод закрытый, нет открытого, матка не обнаружена, поставил  антиварроатозные и антиакарапидозные полоски. и антиакарапидозные полоски.','№6 рут 3х корпусный');
INSERT INTO "jornal" VALUES('28/08/2015',8,10,'карпатка',2,'удовлетворительная',NULL,'расплод закрытый, нет открытого, матка не обнаружена, поставил  антиварроатозные и антиакарапидозные полоски. и антиакарапидозные полоски.','№1');
INSERT INTO "jornal" VALUES('28/08/2015',8,10,NULL,2,NULL,NULL,'расплод закрытый, нет открытого, матка не обнаружена, поставил  антиварроатозные и антиакарапидозные полоски. и антиакарапидозные полоски.','№2');
INSERT INTO "jornal" VALUES('20/09/2015',9,9,'',0,NULL,NULL,'Новая пчелосемья, заселена в новый улей, расплод закрытый на выходе, матка не обнаружена.','№8 дадан');
INSERT INTO "jornal" VALUES('15/04/2016',6,12,'карпатка',2,NULL,NULL,'расплод на 2-х рамках.','№3 дадан');
INSERT INTO "jornal" VALUES('15/04/2016',4,11,'карпатка',2,NULL,NULL,'семья требует срочного исправления и замену матки ','№2 дадан');
INSERT INTO "jornal" VALUES('15/04/2016',NULL,18,'карпатка',2,'хорошая',NULL,'расплод на 2-х рамках.','№7 рут');
INSERT INTO "jornal" VALUES('23/04/2016',10,11,'карпатка',2,'хорошая',NULL,'при осмотре обнаружены три маточника, один оставлен здесь в клетки и два на отводки','№1 дадан');
INSERT INTO "jornal" VALUES('28/04/2016',NULL,NULL,NULL,NULL,NULL,NULL,'обнаружена мертвая матка трутовка.','№2 дадан');
INSERT INTO "jornal" VALUES('28/04/2016',NULL,NULL,'карпатка',2,NULL,NULL,'объеденил с №2 дадан, корпусом с верху.','№3 дадан');
INSERT INTO "jornal" VALUES('12/05/2016',21,25,'карпатка с.нижняя татарка',3,'отличная',8,'расплод открытый и закрытый','№6 рут(с.Московское)');
INSERT INTO "jornal" VALUES('12/05/2016',NULL,NULL,NULL,NULL,NULL,16,'пойманый рой организован в семью.','№5 рут (с.Московское)');
INSERT INTO "jornal" VALUES('15/05/2016',6,9,'карпатка',0,NULL,2,'семья сформирована из отводка №1','№8 дадан');
INSERT INTO "jornal" VALUES('17/05/2016',10,11,'карпатка',2,NULL,1,'расплод есть открытый и закрытый, поставил магазин с 10 рамками.','№1 дадан');
INSERT INTO "jornal" VALUES('17/05/2016',9,11,'карпатка',2,NULL,2,'расплод есть открытый и закрытый.','№3 дадан');
INSERT INTO "jornal" VALUES('31/05/2016',10,12,'карпатка',2,NULL,NULL,'расплод есть открытый и закрытый.','№1 дадан');
INSERT INTO "jornal" VALUES('31/05/2016',NULL,26,NULL,2,NULL,NULL,'расплод есть открытый и закрытый.','№7 рут');
INSERT INTO "jornal" VALUES('31/05/2016',NULL,NULL,NULL,3,NULL,NULL,'расплод есть открытый и закрытый, есть много мисочек,нужно осмотреть позже. ','№3 дадан');
INSERT INTO "jornal" VALUES('31/05/2016',5,8,NULL,3,NULL,NULL,'расплод закрытый, нет открытого, нужно осмотреть позже.','№8 дадан');
INSERT INTO "jornal" VALUES('07/06/2016',NULL,NULL,'карпатка',3,NULL,NULL,'подставил закрытый и открытый 3-х дневный расплод','№8 дадан');
INSERT INTO "jornal" VALUES('07/06/2016',10,12,'карпатка',2,NULL,NULL,'есть расплод открытый и закрытый','№1 дадан');
INSERT INTO "jornal" VALUES('07/06/2016',10,12,'карпатка',2,NULL,NULL,'есть расплод закрытый и открытый','№3 дадан');
INSERT INTO "jornal" VALUES('14/06/2016',34,35,'карпатка',3,'отличная',3,'есть расплод закрытый и открытый,срезан трутневый расплод.
огрессивное поведение,изьял закрытый расплод, 2 рамки, поставил  в №5.


','№6 рут 4х корпусный');
INSERT INTO "jornal" VALUES('14/06/2016',NULL,NULL,NULL,NULL,NULL,NULL,'есть расплод закрытый, усилил 2-мя рамками закрытого расплода.','№5 рут');
INSERT INTO "jornal" VALUES('16/06/2016',9,9,NULL,NULL,NULL,NULL,'пойманый рой организован в семью. №9','№9 дадан');
INSERT INTO "jornal" VALUES('19/06/2016',11,12,'карпатка',2,'удовл.',1,'Б.О. Расплод открытый и закрытый, срезал трутневый расплод','№1 дадан');
INSERT INTO "jornal" VALUES('19/06/2016',11,12,NULL,2,'удовл.',2,'Б.О. Расплод открытый и закрытый, срезал трутневый расплод','№2 дадан');
INSERT INTO "jornal" VALUES('01/07/2016',6,12,NULL,2,'удовл.',NULL,'Б.О. Закрытый расплод, маточники','№2 дадан');
INSERT INTO "jornal" VALUES('01/07/2016',4,9,NULL,NULL,NULL,NULL,'Б.О. трутневая матка, нужно наблюдать, поставил маточник','№8 дадан');
INSERT INTO "jornal" VALUES('04/07/2016',34,35,'карпатка',3,'отличная',2,'Б.О. расплод открытый и закрытый, собран мед.','№6 рут (с.Московское)');
INSERT INTO "jornal" VALUES('04/07/2016',18,14,NULL,NULL,NULL,1,'Б.О. расплод открытый и закрытый','№5 рут (с.Московское)');
INSERT INTO "jornal" VALUES('04/07/2016',18,12,NULL,NULL,NULL,1,'Б.О. расплод открытый и закрытый','№9 дадан (с.Московское)');
INSERT INTO "jornal" VALUES('05/07/2016',26,27,'карпатка',2,'хорошая',NULL,'Б.О. расплод открытый и закрытый','№7 рут 3-х корпусный');
INSERT INTO "jornal" VALUES('06/07/2016',NULL,8,NULL,0,NULL,NULL,'заключил матку под колпачок для наблюдения','№8 дадан ');
INSERT INTO "jornal" VALUES('10/07/2016',7,9,NULL,0,NULL,NULL,'появился расплод открытый.','№2 дадан');
INSERT INTO "jornal" VALUES('15/07/2016',12,12,'карпатка',2,'хорошая',1,'Б.О. расплод открытый и закрытый','№1 дадан');
INSERT INTO "jornal" VALUES('15/07/2016',24,27,'карпатка',2,'хорошая',1,'Б.О. расплод открытый и закрытый','');
INSERT INTO "jornal" VALUES('15/07/2016',NULL,9,NULL,0,NULL,1,'пересажен отводок в улей с расплодом и маткой','№2 дадан ');
INSERT INTO "jornal" VALUES('15/07/2016',NULL,NULL,NULL,0,NULL,NULL,'Б.О. расплод открытый и закрытый','№8 дадан');
INSERT INTO "jornal" VALUES('15/07/2016',NULL,5,NULL,NULL,NULL,NULL,'ждем засев маткой личинок, подсилил расплодом с улья № 7','№4 рут 16 рамочный');
INSERT INTO "jornal" VALUES('22/07/2016',6,9,NULL,0,NULL,NULL,'расплод закрытый и засев, матка обнаружена.','№8 дадан');
INSERT INTO "jornal" VALUES('22/07/2016',8,9,NULL,0,NULL,NULL,'Б.О. расплод открытый и закрытый, нужно подставить ващину','№2 дадан');
INSERT INTO "jornal" VALUES('26/07/2016',4,5,NULL,0,NULL,NULL,'появился расплод. С.Р. поставил антивароотозные полоски.','№4 рут 16 рамочный');
INSERT INTO "jornal" VALUES('31/07/2016',NULL,NULL,NULL,2,NULL,NULL,'Б.О. есть расплод, С.Р.  поставил антивароотозные полоски.','№7 рут 3-х корпусный');
INSERT INTO "jornal" VALUES('31/07/2016',NULL,NULL,NULL,0,NULL,NULL,'Б.О. есть расплод, С.Р.  поставил антивароотозные полоски.','№8 дадан');
INSERT INTO "jornal" VALUES('09/08/2016',5,7,NULL,0,NULL,NULL,'Б.О. расплод открытый и закрытый','4 рут 16 рамочный');
INSERT INTO "jornal" VALUES('23/08/2016',15,18,NULL,NULL,NULL,NULL,'Б.О. расплод открытый и закрытый,взял 2 медовые рамки','№9 дадан (с.Московское)');
INSERT INTO "jornal" VALUES('23/08/2016',18,18,NULL,NULL,NULL,NULL,'Б.О. расплод открытый и закрытый, взял 4 рамки с медом','№5 рут (с.Московское)');
INSERT INTO "jornal" VALUES('23/08/2016',29,32,'карпатка',3,'отличная',NULL,'Б.О. расплод открытый и закрытый, взял 4 рамки с медом, снял 4-й корпус','№6 рут (с.Московское)');
INSERT INTO "jornal" VALUES('23/08/2016',12,12,'карпатка',2,'хорошая',NULL,'Б.О. расплод открытый и закрытый.','№1 Дадан');
INSERT INTO "jornal" VALUES('23/08/2016',6,10,NULL,0,NULL,NULL,'Б.О. расплод открытый и закрытый.','№4 рут 16 рамочный');
INSERT INTO "jornal" VALUES('02/09/2016',NULL,NULL,NULL,2,NULL,NULL,'Б.О. расплод открытый и закрытый., С.Р.  поставил антивароотоз','№3 дадан');
INSERT INTO "jornal" VALUES('02/09/2016',NULL,NULL,NULL,0,NULL,NULL,'Б.О. расплод открытый и закрытый, сократил гнездо, поставил утеплительные перегородки., С.Р.  поставил антивароотоз','№2 дадан');
INSERT INTO "jornal" VALUES('03/10/2016',NULL,NULL,NULL,3,NULL,NULL,'С.Р. Бипином','№6 рут (с.Московское)');
INSERT INTO "jornal" VALUES('03/10/2016',NULL,NULL,NULL,NULL,NULL,NULL,'С.Р. Бипином','№5 рут (с.Московское)');
INSERT INTO "jornal" VALUES('03/10/2016',NULL,NULL,NULL,NULL,NULL,NULL,'С.Р. Бипином','№9 дадан (с.Московское)');
INSERT INTO "jornal" VALUES('02/28/2017',NULL,NULL,NULL,NULL,NULL,NULL,'Визуалный осмотр всей пасеки, выявил погибшую пчелосемью, почистил поддон.','№8 дадан');
INSERT INTO "jornal" VALUES('02/28/2017',NULL,NULL,NULL,NULL,NULL,NULL,'Визуалный осмотр всей пасеки, выявил погибшую пчелосемью, почистил поддон.','№10 рут');
INSERT INTO "jornal" VALUES('04/12/2017',NULL,NULL,NULL,3,NULL,NULL,'Б.О.  Есть закрытый расплод С.Р. поставил пластинки Варроадез','№1 дадан');
INSERT INTO "jornal" VALUES('04/12/2017',NULL,NULL,NULL,1,NULL,NULL,'Б.О.  Есть закрытый расплод С.Р. поставил пластинки Варроадез','№2 дадан');
INSERT INTO "jornal" VALUES('04/12/2017',NULL,NULL,NULL,1,NULL,NULL,'Б.О.  Есть закрытый расплод С.Р. поставил пластинки Варроадез','№3 дадан');
INSERT INTO "jornal" VALUES('04/12/2017',NULL,NULL,NULL,1,NULL,NULL,'Б.О.  Есть закрытый расплод и 3-х дневный С.Р. поставил пластинки Варроадез','№4 рут 16 рамочный');
INSERT INTO "jornal" VALUES('04/12/2017',NULL,NULL,NULL,3,NULL,NULL,'Б.О.  Есть закрытый расплод С.Р. поставил пластинки Варроадез','№7 рут');
INSERT INTO "jornal" VALUES('04/13/2017',NULL,NULL,NULL,4,'отличная',NULL,'Б.О.  Есть закрытый расплод С.Р. поставил пластинки Варроадез','№6 рут (с.Московское)');
INSERT INTO "jornal" VALUES('04/13/2017',NULL,NULL,NULL,NULL,NULL,NULL,'Б.О.  Есть закрытый расплод С.Р. поставил пластинки Варроадез','№9 дадан (с.Московское)');
INSERT INTO "jornal" VALUES('04/13/2017',NULL,NULL,NULL,NULL,NULL,NULL,'при осмотре обноружил полностью погибшую пчелосемью, в ульи зеленая плесень.','№5 рут (с.Московское)');
INSERT INTO "jornal" VALUES('04/28/2017',9,NULL,'карпатка',2,'хорошая',1,'Б.О. расплод открытый и закрытый.','№1 Дадан');
INSERT INTO "jornal" VALUES('04/28/2017',NULL,NULL,NULL,NULL,'удовл.',NULL,'Б.О. расплод открытый и закрытый, наблюдал пчеломатку.','№2 дадан');
INSERT INTO "jornal" VALUES('04/28/2017',NULL,NULL,NULL,NULL,'удовл.',NULL,'Б.О. расплод открытый и закрытый, наблюдал пчеломатку.','№3 дадан');
INSERT INTO "jornal" VALUES('04/28/2017',3,NULL,NULL,NULL,NULL,NULL,' расплод открытый и закрытый.','№4 рут 16 рамочный');
INSERT INTO "jornal" VALUES('04/28/2017',NULL,NULL,NULL,3,'хорошая','',' расплод открытый и закрытый.','№7 рут');
INSERT INTO "jornal" VALUES('22/05/2017',NULL,NULL,'карпатка',4,'отличная',4,' расплод открытый и закрытый, обнаружены роевые маточники, сделал отводок.','№6 рут (с.Московское)');
INSERT INTO "jornal" VALUES('22/05/2017',NULL,NULL,NULL,3,'хорошая',5,' расплод открытый и закрытый, поставил 3-й корпус.','№7 рут');
INSERT INTO "jornal" VALUES('04/06/2017',NULL,NULL,NULL,3,'удовл.',2,'расплод открытый и закрытый, много трутневого расплода, нужно менять матку.','№3 дадан');
INSERT INTO "jornal" VALUES('04/06/2017',NULL,NULL,NULL,3,NULL,NULL,'расплод открытый и закрытый, много трутневого расплода, нужно менять матку.','№2 дадан');
INSERT INTO "jornal" VALUES('04/06/2017',NULL,NULL,NULL,3,NULL,NULL,'расплод открытый и закрытый, много трутневого расплода, нужно менять матку.','№2 дадан');
INSERT INTO "jornal" VALUES('04/06/2017',NULL,NULL,'',1,'хорошая',NULL,'расплод открытый и закрытый, наблюдал матку','№4 рут 16 рамочный');
INSERT INTO "jornal" VALUES('10/06/2017',NULL,NULL,NULL,NULL,NULL,NULL,'Б.О. нет расплода, наверное при формировании отводка была изьята матка, подставил расплод от другой семьи.','№6 рут (с.Московское');
INSERT INTO "jornal" VALUES('14/06/2017',12,12,NULL,NULL,'удовл.',NULL,'при осмотре обнаружены маточники,изъяты две рамки с маточниками для отводков','№2 дадан');
INSERT INTO "jornal" VALUES('06/22/2017',18,NULL,NULL,0,'отличная',2,'появился  расплод открытый и закрытый.','№6 рут (с.Московское)');
INSERT INTO "jornal" VALUES('06/22/2017',18,18,NULL,1,NULL,2,' расплод открытый и закрытый.','№9 дадан (с.Московское)');
INSERT INTO "jornal" VALUES('06/23/2017',NULL,NULL,NULL,NULL,NULL,NULL,'расплод открытый и закрытый.','№3 дадан');
INSERT INTO "jornal" VALUES('06/23/2017',NULL,NULL,NULL,NULL,NULL,NULL,'расплода нет,поставил одну рамку открытого расплода','№2 дадан');
INSERT INTO "jornal" VALUES('06/23/2017',NULL,NULL,'карпатка',1,NULL,2,'расплод открытый и закрытый','№4 рут');
INSERT INTO "jornal" VALUES('06/26/2017',NULL,7,NULL,NULL,NULL,NULL,'сформирован из отводка','№8 дадан');
INSERT INTO "jornal" VALUES('06/29/2017',NULL,NULL,NULL,NULL,NULL,NULL,'вышел рой, сократил рамки до 9, оставил  1 маточник.','№1 дадан ');
INSERT INTO "jornal" VALUES('06/29/2017',NULL,NULL,NULL,NULL,NULL,NULL,'поймал рой от семьи дадан №1, подставил рамку с расплодом от рут №4.','№5 рут');
INSERT INTO "jornal" VALUES('07/02/2017',11,NULL,NULL,0,NULL,NULL,'появился  расплод открытый и закрытый, матка новая.','№2 дадан');
INSERT INTO "jornal" VALUES('07/02/2017',6,7,NULL,3,NULL,NULL,'расплод открытый и закрытый.','№8 дадан');
INSERT INTO "jornal" VALUES('06/05/2017',16,16,NULL,1,NULL,NULL,'поставил магазин 13 рамок, 4 из них с вощиной.','№4 рут');
INSERT INTO "jornal" VALUES('08/02/2017',11,11,'карпатка',0,NULL,NULL,'расплод открытый и закрытый,снял магазины','№1 дадан');
INSERT INTO "jornal" VALUES('08/05/2017',NULL,NULL,NULL,NULL,NULL,NULL,'Б.О. расплод открытый и закрытый С.Р. поставил антиварроатозные полоски','№2 дадан');
INSERT INTO "jornal" VALUES('08/05/2017',NULL,NULL,NULL,NULL,NULL,NULL,'С.Р. поставил антиварроатозные полоски','№1 дадан');
INSERT INTO "jornal" VALUES('08/05/2017',NULL,16,NULL,NULL,NULL,NULL,'С.Р. поставил антиварроатозные полоски,снял магазины','№4 рут');
INSERT INTO "jornal" VALUES('08/16/2017',12,18,'карпатка',0,NULL,NULL,'Б.О. расплод закрытый, С.Р. поставил антиварроатозные полоски, семья №10 сформирована в 2017 от отводка семьи № 6','№10 рут(Московское)');
CREATE TABLE "вывод_маток" (
    "id"INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
    "дата_создания" TEXT NOT NULL,
    "семья_воспитательница" TEXT NOT NULL,
    "кол-во_личинок" TEXT,
    "срок_выводка" TEXT,
    "кол-во_выведенных_маток" TEXT,
    "назначение_маток" TEXT
    
);
INSERT INTO "вывод_маток" VALUES(1,'25/06/2016','улей для отводков лев. отсек(желтый)','8','07/07/2016',NULL,'учебные вывод и организация отводков.');
INSERT INTO "вывод_маток" VALUES(2,'07/01/2017','улей для отводков лев. отсек(желтый)',NULL,'16/07/2016',NULL,NULL);
CREATE TABLE отводки (
   `id` INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
    "дата" TEXT NOT NULL,
    "номер_отводка" TEXT NOT NULL,
    "примечание" TEXT
);
INSERT INTO "отводки" VALUES(16,'22/05/2017','Сформирован отводок белый нуклеус в с.московском','Из роевого маточника семьи №6. К.О. на плодность 05/06/2017');
INSERT INTO "отводки" VALUES(17,'07/06/2017','Сформирован отводок желтый отсек 2-х секционного нуклеуса','Открытый расплод без маточника');
INSERT INTO "отводки" VALUES(18,'14/06/2017','Сформирован отводок зеленый отсек,из двух рамок одна кормовая, одна с маточниками','30/06/2017 нужно произвести осмотр');
INSERT INTO "отводки" VALUES(19,'14/06/2017','Сформирован отводок нуклеус из ламината, из двух рамок одна кормовая, одна с маточниками','30/06/2017 нужно произвести осмотр');
INSERT INTO "отводки" VALUES(20,'14/06/2017','Сформирован отводок нуклеус зеленый, из трёх рамок две кормовые, одна с маточником','30/06/2017 нужно произвести осмотр(видел матку 28/06), ждать нужно плодности');
INSERT INTO "отводки" VALUES(21,'06/28/2017','Сформирован отводок нуклеус коричневый теплый, из трёх рамок две кормовые,выпушена на сот неплодная матка ,ждать облета и плодности, до 14/07/

',NULL);
INSERT INTO "отводки" VALUES(22,'06/29/2017','сформирорвал двойной нуклеус(желтый отсек),от дадан №1, из роевых маточников, ждем выход маток и облет.','контроль на плодность ~ 16/07');
INSERT INTO "отводки" VALUES(23,'06/30/2017','зеленый нуклеус,появился однодневный расплод',NULL);
INSERT INTO "отводки" VALUES(24,'07/07/2017','нуклеус из ламината,появился расплод.',NULL);
INSERT INTO "отводки" VALUES(25,'08/02/2017','зеленый нуклеус открытый и закрытый расплод',NULL);
INSERT INTO "отводки" VALUES(26,'08/02/2017','коричневый нуклеус открытый и закрытый расплод',NULL);
INSERT INTO "отводки" VALUES(27,'08/02/2017',' нуклеус  из ламината открытый и закрытый расплод',NULL);
INSERT INTO "отводки" VALUES(28,'08/02/2017','двойной нуклеус(желтый отсек) появился засев яиц',NULL);
CREATE TABLE credit(
  "сумма инвестиций ",
  "Год-месяц-день"
);
INSERT INTO "credit" VALUES(9099.0,'2017-04-10');
CREATE TABLE task (
    "id" INTEGER  PRIMARY KEY AUTOINCREMENT,
    "Day" TEXT NOT NULL,
    "task" TEXT NOT NULL,
    "status" TEXT,
    "descript" TEXT
);
INSERT INTO "task" VALUES(1,'07/05/2017','Сделать нуклеус под маленькую рамку.','*',NULL);
INSERT INTO "task" VALUES(2,'07/05/2017','Купить Фильтр под забрус с кубикантейнером.','*',NULL);
INSERT INTO "task" VALUES(3,'07/05/2017','Купить или сделать шаблон для мисочек под маточники.','*',NULL);
DELETE FROM sqlite_sequence;
INSERT INTO "sqlite_sequence" VALUES('clients',7);
INSERT INTO "sqlite_sequence" VALUES('apis_inventory',57);
INSERT INTO "sqlite_sequence" VALUES('books_apis',10);
INSERT INTO "sqlite_sequence" VALUES('отводки',28);
INSERT INTO "sqlite_sequence" VALUES('вывод_маток',2);
INSERT INTO "sqlite_sequence" VALUES('task',3);
CREATE VIEW "сбор 2016" AS select sum(`кол-во_кг`) from `медосбор` where `дата` like '%/2016%';
CREATE VIEW "сбор_2015" AS select sum(`кол-во_кг`) from `медосбор` where `дата` like '%/2015%';
CREATE VIEW "доход_от_продаж" AS SELECT sum(`количество_kg`*`цена_кг`) from sales;
CREATE VIEW "Стоимость_инвентаря" AS SELECT SUM( `количество` * `цена` ) AS `сумма стоимости инвентаря`,date() as year_M_D
FROM `apis_inventory`;
CREATE VIEW "Санитарные_работы" AS select `дата осмотра`,`номер_улья`,`другие сведения`  from jornal where `другие сведения` like '%С.Р.%';
CREATE VIEW "санитарные_работы" AS
select `дата осмотра`,`номер_улья`,`другие сведения`  from jornal where `другие сведения` like '%С.Р.%';
CREATE VIEW "Балланс_организации" AS select sum(`количество` * `цена`)+40000  AS `сумма стоимости предприятия`,date() as `Год-месяц-день` from apis_inventory;
CREATE VIEW "предстоящие_задачи" AS select * from task where status like '%*%';
CREATE VIEW "доп.ферма" AS
select sum(`количество` * `цена`) AS `сумма расхода`,
date() as `Год-месяц-день` from `расход` where наименование like '%*доп.%';
CREATE VIEW "продажи_2016" AS SELECT sum(`количество_kg`*`цена_кг`) from sales where дата like '%2016%';
CREATE VIEW "apis_more" AS select * from jornal where [другие сведения] like '%погибшую%';
CREATE VIEW "сбор_2017" AS select sum(`кол-во_кг`) from `медосбор` where `дата` like '%/2017%';
CREATE VIEW "Матки_для_замены" AS
SELECT * FROM jornal where `возраст матки` > 2 and  "дата осмотра" like '%2017%';
COMMIT;
